"""
切片（slice）
切片是取出序列中一个范围对应的元素
"""

a = list(range(10))
print(a)

print(a[2:3]) # 2
print(a[5:9]) # [5, 6, 7, 8]

print(a[5:-1]) # [5, 6, 7, 8]
print(a[-5:9]) # [5, 6, 7, 8]
print(a[-5:-1]) # [5, 6, 7, 8]

# 缺省
print(a[5:]) # [5, 6, 7, 8, 9]
print(a[:5]) # [0, 1, 2, 3, 4]
print(a[100:]) # []
print(a[:100]) # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# step为正数
print(a[0:6:2]) # [0, 2, 4]
print(a[::2]) # [0, 2, 4, 6, 8]
print(a[:-2:2]) # [0, 2, 4, 6]
print(a[4::2]) # [4, 6, 8]

# step为负数
print(a[::-1])  # 实现字符串反转 [9, 8, 7, 6, 5, 4, 3, 2, 1, 0]
print(a[5::-1]) # [5, 4, 3, 2, 1, 0]
print(a[:4:-2]) # [9, 7, 5]

a1 = str(-321)
print(a1)
print(a1[:0:-1])